Autodesk.Revit.DB.NavisworksExportOptions.SetSelectedElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.NavisworksExportOptions.ConvertLinkedCADFormats
True to convert linked CAD formats, false otherwise.
Default value is true.
Since:
2020

Autodesk.Revit.DB.NavisworksExportOptions.ConvertLights
True to convert lights, false otherwise.
Default value is false.
Since:
2020

Autodesk.Revit.DB.NavisworksExportOptions.FacetingFactor
Faceting factor.
Default value is 1.0.
Since:
2020

Autodesk.Revit.DB.NavisworksExportOptions.ViewId
The element id of the view to export. InvalidElementId by default. Used only when ExportScope = View.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014